import React, { useEffect } from "react";
import { Link } from "react-router-dom";
import NavBar from "./NavBar";
function Page7() {
  useEffect(() => {
    document.title = 'Kabir Sant-Satsang Mandir -AboutUs';
}, []);
  const Top =()=>{
    window.scrollTo(0,0);
 }
  return (
    <>
    <NavBar />
      <div className="Page6__Main" style={{ background: "#edd36b" }}>
        <div className="container">
          <div className="d-flex  justify-content-center align-items-center">
            <div className="col-md-8">
              <div className="card-body mt-5">
                <h4 className="card-title text-center text-danger">
                  श्री सद्गुरवे नमः
                </h4>
                <h2 className="card-title text-center text-danger mt-3">
                  कबीर सन्त सत्संग मन्दिरको संस्थागत नियमहरू
                </h2>
                <div
                  className="card-text mt-3"
                  style={{
                    fontSize: "1.3rem",
                    textAlign: "justify",
                    color: "#0202f5",
                  }}
                >
                  <p>
                    १. कल्याण इच्छुक साधक-साधिकाहरुले पूर्णतः ब्रहाचर्यको पालना
                    गर्नु पर्नेछ ।
                  </p>
                  <p>
                    २. आश्रममा रहेर आश्रमको हकहितको लागि क्रियाकलाप गर्नु नै
                    प्रथम धर्म हो कुनै पनि बोली- व्यवहार जसले नकारात्मकता
                    फैलाउँछ भने ति सबै कृत्य गर्न मनाही छ ।
                  </p>
                  <p>
                    
                    ३. मन्दिर परिसर भित्र आमिष (मांसाहार), मद्यपान तथा नशालु
                    पदार्थ सेवन गर्न सख्त मनाही छ ।
                  </p>
                  <p>
                    ४. मन्दिर परिसर भित्र सत्संग, चिन्तन र दर्शन बाहेक अन्य कुनै
                    पनि राजनितिक एवं व्यक्तिगत निरुपण गर्ने जस्ता बार्तालाप गर्न
                    पाइने छैन ।
                  </p>
                  <p>
                    ५. मन्दिरमा आर्थिक सहयोग गर्नुहुने महानुभावहरुले संस्थाको
                    रसिद लिन नबिर्सिनुहोला ।
                  </p>
                  <p>
                    ६. आश्रमबासी तथा आगन्तुक सबैले धारा, बिजुली र टेलिफोनको
                    प्रयोग गर्न मितव्ययीताको सिद्धान्तलाई ध्यानमा राख्नुपर्नेछ ।
                  </p>
                  <p>
                    
                    ७. बिहान ५ बजे वन्दना, ४ बजे प्रसाद, १ बजे सत्संग, बेलुकी ६
                    बजे प्रार्थना हुनेछ । बृद्ध र अशक्त बाहेक सबैले समयमा नै
                    उपस्थित हुनुपर्नेछ ।
                  </p>
                  <p>
                    ८. कोही पनि बाहिर जाँदा आश्रमको व्यवस्थापक अथवा अन्य
                    सदस्यहरुलाई सूचित गरेर मात्र जानुपर्नेछ । यदि ढिलोभएको
                    खण्डमा आश्रममा फोन गरेर जानकारी दिनुपर्नेछ ।
                  </p>
                  <p>
                    ९. कबीर सन्त सत्संग मन्दिर सन्त परम्पराको अक्षुण्ण धाराको एक
                    प्रतिक हो, अतएव राम रहिमको समानता, पुरान र कुरानको एक
                    निष्ठता साथै अन्यान्य धर्मग्रन्थहरुको समन्वय गराउनु नै एक
                    मात्र उद्देश्य हो । तथापि, विवेकको निर्णय सन्तपरम्परामा
                    शिरमौर रहनेछ ।
                  </p>
                  <p>
                    १०.कबीर साहेबद्धारा प्रतिपादित पारख सिद्धान्त एवं वर्तमान
                    परिवेशलाई सुधारोन्मुख दिशामा लैजाने नैतिक, धार्मिक र
                    आध्यात्मिक प्रवचन गर्ने ।
                  </p>
                  <p>
                    ११. यस आश्रममा पाल्नुहुने आगन्तुक अभ्यागतहरु तीन दिनसम्म
                    मात्र आश्रममा विश्राम गर्न पाउनुहुनेछ ।
                  </p>
                  <p>
                    १२. आश्रमबाट अन्यत्र भ्रमण (रामत) जाँदाखेरि कोठाको साँचो
                    आश्रम प्रमुखको निगरानीमा बुझाएर जानुपर्नेछ ।
                  </p>
                  <p>
                    १३. आश्रममा जतिपनि सेवा कार्य एवं योगदान गर्नु भनेको केवल
                    स्वयंको चित्तशुद्धिको लागि हो बडप्पन एवं अहं पुष्टिको लागि
                    होइन । अतः निष्कामकर्म नै अन्तिम छ ।
                  </p>
                  <p>
                    १४. यहाँको राम्रो पक्ष सबैलाई भन्नुहोला तर नराम्रो पक्ष
                    हामीलाई भन्न नबिर्सिनुहोला ताकि आगामी दिनमा नराम्रो पक्षको
                    सुधार हुन सकोस्, जस्बाट अध्यात्मको शाश्वत राजमार्गमा सबै
                    परमार्थ प्रेमी पथिकहरुलाई लम्किरहने सात्विकता र सकारात्मता
                    प्राप्त होस् ।
                  </p>
                </div>
              </div>
            </div>
          </div>
        </div>
        <div className="container">
          <div className="d-flex justify-content-around  mb-3">
            <Link to="/page6">
              <button type="button" onClick={Top}  className="btn btn-outline-dark">
                ←previous
              </button>
            </Link>
            <Link to="/page8">
              <button type="button" onClick={Top}  className="btn btn-outline-dark">
                next →
              </button>
            </Link>
          </div>
        </div>
      </div>
    </>
  );
}
export default Page7;
